[LANG]
language=Vietnamese (Việt Nam)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Lỗi cú pháp SQL
200002=Tệp không tồn tại
200003=Tệp bị hỏng
200004=Lỗi tham số
200026=Tên bảng bị trùng lặp
200027=Tên bảng không tồn tại
200028=Lỗi nhập tệp CSV, không thể tạo SQL, vui lòng kiểm tra nội dung tệp CSV và các mục cài đặt có đúng không
300001=Chưa chọn cột bảng để tạo chỉ mục
300002=Câu lệnh SQL không được để trống
300003=Phân tích SQL chỉ hỗ trợ câu lệnh truy vấn SELECT
[STRING]
home=Trang chủ
database=Cơ sở dữ liệu
analysis=Phân tích
view=View
setting=Cài đặt
items=Bản ghi
tables=Bảng
views=View
triggers=Trigger
columns=Cột
indexes=Chỉ mục
table=Bảng
clear-all=Xóa tất cả
yes=Đồng ý
no=Hủy
welcome-text=Chào mừng đến với CuteSqlite
home-text1=CuteSqlite là công cụ máy khách đồ họa (GUI) cho Sqlite3.
home-text2=Nó cho phép bạn thiết kế, tạo và duyệt cơ sở dữ liệu, xử lý các đối tượng cơ sở dữ liệu,
home-text3=và chèn dữ liệu cũng như thiết kế và chạy các truy vấn SQL để xử lý dữ liệu đã lưu trữ.
home-text4=Bạn cũng có thể di chuyển cơ sở dữ liệu và dữ liệu từ các nhà cung cấp cơ sở dữ liệu khác sang cơ sở dữ liệu Sqlite.
db-section-text=Cơ sở dữ liệu Sqlite
analysis-text1=CuteSqlite cho phép bạn phân tích và tối ưu hóa hiệu suất của các câu lệnh SQL.
analysis-text2=và cho phép bạn phân tích dung lượng lưu trữ của mỗi bảng trong cơ sở dữ liệu,
analysis-text3=cũng như cấu hình các tham số của cơ sở dữ liệu để tối ưu hóa cơ sở dữ liệu.
perf-analysis-section-text=Phân tích hiệu suất
error-text=Lỗi hệ thống:
create-database=Tạo cơ sở dữ liệu mới (Ctrl+N)
open-database=Mở cơ sở dữ liệu (Ctrl+O)
refresh-database=Làm mới cơ sở dữ liệu (F5)
delete-database=Xóa cơ sở dữ liệu đã chọn khỏi danh sách (Del)
override-user-db=Dữ liệu của tệp sẽ không thể khôi phục sau khi xóa, bạn có chắc chắn muốn ghi đè cơ sở dữ liệu không?
create-db-success-text=Tạo cơ sở dữ liệu thành công
open-db-exists-inlist=Cơ sở dữ liệu đã được mở, vui lòng không thao tác trùng lặp
open-db-success-text=Mở cơ sở dữ liệu thành công
delete-user-db=Bạn có chắc chắn muốn xóa cơ sở dữ liệu "{dbName}" đã chọn khỏi danh sách không?
delete-db-success-text=Xóa cơ sở dữ liệu khỏi danh sách thành công
query-editor=Trình soạn thảo truy vấn
history=Lịch sử
history-tip=Lịch sử (F8)
result-list=Kết quả
result-info=Thông tin
result-table-data=Dữ liệu bảng
table-properties=Thuộc tính bảng
exec-select-sql=Thực thi truy vấn đã chọn hiện tại (F9)
exec-all-sql=Thực thi tất cả truy vấn (F10)
explain-select-sql=Explain câu lệnh SQL đã chọn hiện tại (F11)
explain-query-plan-sql=Explain query plan câu lệnh SQL đã chọn hiện tại (F12)
query-page-help=Chức năng tự động hoàn thành: [Tab]->Thẻ tiếp theo; [Ctrl+Space]->Liệt kê các thẻ khớp; [Ctrl+Enter]->Liệt kê tất cả các thẻ
no-select-userdb=Chưa chọn cơ sở dữ liệu
no-sql-statement=Chưa nhập câu lệnh SQL trong trình soạn thảo truy vấn
no-sql-content=Không có câu lệnh SQL trong trình soạn thảo truy vấn
show-form-view=Hiển thị chế độ xem biểu mẫu
export-result-as=Xuất ra... (Ctrl+Alt+E)
copy-result-data=Sao chép dữ liệu vào Clipboard
clear-all=Xóa tất cả
ok=Đồng ý
cancel=Hủy
export-text-description=Chọn định dạng xuất dữ liệu
csv-settings=Tùy chọn csv
csv-field-settings=Cột
csv-line-settings=Dòng
csv-charset-settings=Mã hóa
excel-settings=Tùy chọn Excel
sql-settings=Tùy chọn SQL
export-fields-settings=Chọn cột để xuất
terminated-by=Ký tự phân cách
enclosed-by=Ký tự bao quanh
escaped-by=Ký tự thoát
field-terminated-by=Ký tự phân cách cột
field-enclosed-by=Ký tự bao quanh cột
field-escaped-by=Ký tự thoát cột
line-terminated-by=Ký tự xuống dòng
add-column-name=Thêm tên cột vào tiêu đề
csv-charset=Mã hóa
excel-column-max-size=Giới hạn kích thước cột văn bản
excel-decinmal-places=Số thập phân
structure-only=Chỉ cấu trúc bảng
data-only=Chỉ dữ liệu
structure-and-data=Cấu trúc bảng và dữ liệu
select-all=Chọn tất cả
deselect-all=Bỏ chọn tất cả
save-to-file=Xuất ra tệp
expert-fmt-error=Vui lòng chọn định dạng tệp xuất dữ liệu
terminated-by-error=Vui lòng nhập giá trị "Kết thúc bằng"
enclosed-by-error=Vui lòng nhập giá trị "Bao quanh bởi"
escaped-by-error=Vui lòng nhập giá trị "Ký tự thoát"
line-terminated-by-error=Giá trị "Kết thúc bằng" của dòng không chính xác
excel-column-max-size-error=Vui lòng nhập giá trị "Giới hạn kích thước cột văn bản"
excel-decinmal-places-error=Vui lòng nhập giá trị "Số thập phân"
export-sql-error=Vui lòng chọn tùy chọn SQL
selected-fields-error=Vui lòng chọn cột để xuất
export-path-error=Vui lòng nhập đường dẫn tệp xuất
sql-notsupport-multitable-query-error=Không hỗ trợ xuất kết quả truy vấn nhiều bảng và truy vấn con
export-success-text=Xuất thành công, đã xuất {rows} dòng dữ liệu, bạn có muốn mở tệp không?
open-the-file=Mở tệp
export-file-exists-prompt={export-path} đã tồn tại, bạn có muốn thay thế không?
limit-rows=Giới hạn dòng
offset=Dòng bắt đầu
rows=Số dòng
copy-all-rows-to-clipboard=Sao chép tất cả dòng vào Clipboard	Ctrl+Alt+A
copy-sel-rows-to-clipboard=Sao chép dòng đã chọn vào Clipboard	Ctrl+Alt+H
copy-all-rows-as-sql=Sao chép tất cả dòng dưới dạng SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=Sao chép dòng đã chọn dưới dạng SQL	Ctrl+Alt+K
read-only=Chỉ đọc
filter=Bộ lọc (Ctrl+Alt+F)
filter-in-use=Đang sử dụng bộ lọc
refresh=Làm mới (Ctrl+F5)
refresh-page=Làm mới
new-row-tip=Tạo dòng mới (Ctrl+Alt+N)
copy-row-tip=Sao chép một dòng (Ctrl+Alt+C)
save-tip=Lưu (Ctrl+Alt+S)
delete-tip=Xóa dòng đã chọn (Ctrl+Del)
cancel-tip=Hoàn tác thay đổi (Ctrl+Alt+Z)
revert-tip=Khôi phục
save=Lưu
revert=Hoàn tác thay đổi
column=Tên cột
condition=Điều kiện
value=Giá trị
delete-confirm-text=Bạn có chắc chắn muốn xóa dòng đã chọn không?
query=Truy vấn
result=Kết quả
affected-rows=Số dòng bị ảnh hưởng
exec-time=Thời gian thực thi
transfer-time=Thời gian truyền
total-time=Tổng thời gian
database-create=Tạo cơ sở dữ liệu mới		Ctrl+N
database-open=Mở cơ sở dữ liệu		Ctrl+O
database-refresh=Làm mới cơ sở dữ liệu		Ctrl+R
database-delete=Xóa cơ sở dữ liệu		Del
database-copy=Sao chép cơ sở dữ liệu thành...	Ctrl+P
database-export-as-sql=Xuất cơ sở dữ liệu ra SQL	Ctrl+E
database-import-from-sql=Nhập SQL vào cơ sở dữ liệu	Ctrl+I
database-new=Tạo
database-new-table=Bảng
database-new-view=View
database-new-trigger=Trigger
export-as-sql-text-description=Xuất bảng/view/trigger của cơ sở dữ liệu đã chọn dưới dạng SQL
select-database=Cơ sở dữ liệu đã chọn
database-objects=Đối tượng
structure-and-data-settings=Cài đặt cấu trúc và dữ liệu
insert-statement-settings=Cài đặt câu lệnh INSERT
tbl-statement-settings=Cài đặt câu lệnh bảng
retain-column-text=Giữ tên cột trong "Insert Into"
contain-multi-rows-text=Mỗi câu lệnh "Insert" chứa nhiều dòng (VALUES)
retain-table-text=Giữ bảng cũ (Create Table If Not Exists ...)
override-table-text=Ghi đè bảng cũ (DROP TABLE, sau đó CREATE TABLE)
import-from-sql-text-description=Thực thi hàng loạt các câu lệnh trong tệp SQL.
abort-on-error-text=Dừng khi gặp lỗi.
import-file-not-exists=Tệp SQL nhập không tồn tại, vui lòng chọn lại.
import-path-empty-error=Đường dẫn tệp nhập không được để trống.
import=Nhập
export=Xuất
tbl-name=Tên bảng
new-table=Tạo bảng
new-view=Tạo view
new-trigger=Tạo trigger
database=Cơ sở dữ liệu
schema=Schema
table-columns=Cột
table-indexes=Chỉ mục
table-foreignkeys=Khóa ngoại
column-name=Tên cột
data-type=Kiểu dữ liệu
default=Mặc định
check=Kiểm tra
index-name=Tên chỉ mục
index-type=Loại chỉ mục
index-unique=Unique
partial-clause=Mệnh đề một phần
comments=Ghi chú
to-be-selected=Cột chờ chọn
selected=Cột đã chọn
up=▲
down=▼
no-columns-selected=Chưa chọn cột, vui lòng chọn
sql-preview=Xem trước SQL
tbl-name-empty=Tên bảng không được để trống
tbl-name-duplicated=Tên bảng bị trùng lặp
create-table-success-text=Tạo bảng thành công.
alter-table-success-text=Sửa bảng thành công.
rename-table-success-text=Đổi tên bảng thành công.
delete-column-confirm-text=Cột đã chọn được tham chiếu bởi một hoặc nhiều chỉ mục. Xóa cột này cũng sẽ sửa đổi các chỉ mục tương ứng. Bạn có chắc chắn muốn tiếp tục xóa không?
delete-index-confirm-text=Chỉ mục đã chọn được tham chiếu bởi một hoặc nhiều cột. Xóa chỉ mục này cũng sẽ sửa đổi các cột tương ứng. Bạn có chắc chắn muốn tiếp tục xóa không?
delete-confirm-text=Bạn có chắc chắn muốn tiếp tục xóa không?
new-view=Tạo view
new-trigger=Tạo trigger
create-a-view-name=Tên view mới
view-name-not-empty=Tên view mới không được để trống
view-name-duplicated=Tên view bị trùng lặp
create-a-trigger-name=Tên trigger
trigger-name-not-empty=Tên trigger không được để trống
trigger-name-duplicated=Tên trigger bị trùng lặp
execute-sql-success=Thực thi SQL thành công
copy-db-success-text=Sao chép cơ sở dữ liệu thành công
table-open=Mở dữ liệu bảng		Alt+O
table-create=Tạo bảng		Alt+N
table-alter=Sửa bảng		Alt+A
table-rename=Đổi tên bảng		Alt+M
table-truncate=Xóa sạch bảng		Alt+T
table-drop=Xóa bảng		Alt+Del
table-copy-as=Sao chép bảng thành...		Alt+P
table-sharding-as=Phân mảnh		Alt+G
table-export=Xuất bảng thành...	Alt+E
table-import-sql=Nhập từ tệp SQL	Alt+I
table-import-csv=Nhập từ tệp CSV	Alt+J
table-manage-index=Quản lý chỉ mục bảng
table-manage-foreign-key=Quản lý khóa ngoại bảng
properties=Thuộc tính
primary-key-duplicated=Khóa chính (Primary key) bị định nghĩa trùng lặp.
foreignkey-name=Tên khóa ngoại
referencing-columns=Cột bảng này
referenced-table=Bảng tham chiếu
referenced-columns=Cột tham chiếu
on-update=On Update
on-delete=On Delete
insert-new-column=Thêm cột mới
insert-new-index=Thêm chỉ mục mới
insert-new-foreignkey=Thêm khóa ngoại mới
insert-del-column=Xóa cột đã chọn
insert-del-index=Xóa chỉ mục đã chọn
insert-del-foreignkey=Xóa khóa ngoại đã chọn
select-referenced-table-first=Vui lòng chọn bảng tham chiếu trước
new-table-name=Tên bảng mới
table-name-not-empty=Tên bảng mới không được để trống
table-name-duplicated=Tên bảng mới bị trùng lặp
ai-column-exists=Cột tự tăng (AUTOINCREMENT) đã tồn tại.
ai-fobidden-multi-pk=Đã có cột tự tăng (AUTOINCREMENT), không cho phép nhiều cột khóa chính.
ai-column-must-integer=Cột tự tăng (AUTOINCREMENT) phải là kiểu số nguyên INTEGER.
truncate-table-confirm-text=Sau khi xóa sạch bảng, dữ liệu không thể khôi phục, bạn có chắc chắn muốn xóa sạch không?
truncate-table-success-text=Xóa sạch dữ liệu bảng thành công
drop-table-confirm-text=Sau khi xóa bảng dữ liệu, dữ liệu không thể khôi phục, bạn có chắc chắn muốn xóa không?
drop-table-success-text=Xóa bảng dữ liệu thành công
copy-table-text-description=Cấu hình tham số sao chép, hỗ trợ phân mảnh bảng dữ liệu
from-db-name=Cơ sở dữ liệu nguồn
from-tbl-name=Bảng nguồn
to-db-name=Cơ sở dữ liệu đích
to-tbl-name=Bảng đích
table-sharding-setttings=Phân mảnh bảng dữ liệu
enable-table-sharding=Bật phân mảnh bảng dữ liệu
table-suffix-begin={suffix} Số bắt đầu
table-suffix-end={suffix} Số kết thúc
advanced-settings=Tùy chọn nâng cao phân mảnh bảng
enable-copy-data-with-strategy=Bật chiến lược, sao chép dữ liệu vào bảng phân mảnh
sharding-strategy-express-text=Biểu thức chiến lược phân bảng: {n}
preview-sql=Xem trước câu lệnh SQL
structure-and-data-settings-unknown=Chưa chọn cài đặt cấu trúc và dữ liệu
table-suffix-error=Số phân mảnh không hợp lệ, vui lòng điền giá trị đúng
target-table-name-no-n=Bảng đích phải chứa chuỗi "{n}".
sharding-strategy-express-empty=Biểu thức chiến lược phân bảng không được để trống
copy-table-success-text=Sao chép bảng thành công.
start=Bắt đầu
complete=Hoàn thành
express-title=Biểu thức chiến lược phân mảnh bảng
functions=Hàm
express-editor-help=Biểu thức - Nhấp đúp vào hàm hoặc cột để chèn vào trình soạn thảo
import-from-csv-text-description=Các mục cài đặt để nhập dữ liệu từ tệp CSV
source-csv-file=Đường dẫn tệp CSV nguồn
target-database=Cơ sở dữ liệu đích
target-table=Bảng đích
columns-setttings=Cột
csv-data=Dữ liệu CSV
column-name-on-top=Dòng đầu tiên làm tên cột
line-terminated-by=Ký tự xuống dòng
csv-null-as-keyword=null/NULL làm từ khóa SQL
encoding=Encoding
import-success-text=Nhập thành công
incorrect-sql-statement=Câu lệnh SQL sai
import-error-text=Lỗi nhập
table-manage-columns=Quản lý cột
table-drop-column=Xóa cột
table-manage-indexes=Quản lý chỉ mục
table-drop-index=Xóa chỉ mục
create-view=Tạo view mới
open-view=Mở view
drop-view=Xóa view
create-trigger=Tạo trigger
open-trigger=Mở trigger
drop-trigger=Xóa trigger
drop-view-confirm-text=Sau khi xóa view, view không thể khôi phục, bạn có chắc chắn muốn xóa không?
drop-view-success-text=Xóa view thành công
drop-trigger-confirm-text=Sau khi xóa trigger, trigger không thể khôi phục, bạn có chắc chắn muốn xóa không?
drop-trigger-success-text=Xóa trigger thành công
sql-templates=Mẫu câu lệnh SQL
pragma-templates=Pragmas
sql-log=Lịch sử SQL
clear-all=Xóa tất cả
use=Sử dụng
explain=Explain
top=Ghim
untop=Bỏ ghim
copy=Sao chép
delete=Xóa
today=Hôm nay
yestoday=Hôm qua
delete-sql-log-confirm-text=Bạn có chắc chắn muốn xóa nhật ký SQL không?
copy-to-clipboard=Đã sao chép vào Clipboard
save-success-text=Lưu thành công
delete-success-text=Xóa thành công
data-has-changed=Dữ liệu đã thay đổi, bạn có chắc chắn muốn đóng trang không?
not-save-and-close=Không lưu, đóng
cancel=Hủy đóng
table-export-as=Xuất bảng dữ liệu	Alt+E
export-as-sql-success-text=Xuất thành công, bạn có muốn mở tệp không?
new-query=Tạo cửa sổ truy vấn mới (F7)
save-current=Lưu hiện tại (Ctrl+S)
save-all=Lưu tất cả (Ctrl+Shift+S)
first-page=Trang đầu
prev-page=Trang trước
next-page=Trang sau
last-page=Trang cuối
save-if-data-has-changed=Dữ liệu đã thay đổi, bạn có chắc chắn muốn lưu trước không?
unsort=Bỏ sắp xếp
tab-close-this=Đóng
tab-close-others=Đóng các tab khác
tab-close-left=Đóng tất cả bên trái
tab-close-right=Đóng tất cả bên phải
perf-analysis=Phân tích hiệu suất
perf-analysis-reports=Báo cáo phân tích
store-analysis=Phân tích lưu trữ
db-params=Tham số cơ sở dữ liệu
not-select-sql=Chỉ hỗ trợ câu lệnh SELECT
open-sql-log=Mở nhật ký SQL để phân tích hiệu suất (Ctrl+L)
add-sql-analysis=Nhập câu lệnh SQL để phân tích hiệu suất (Ctrl+I)
sql-log-not-found=Không tìm thấy nhật ký SQL, vui lòng kiểm tra xem đã bị xóa chưa
original-sql=Câu lệnh SQL gốc
where-clause-analysis=Phân tích mệnh đề WHERE
order-clause-analysis=Phân tích mệnh đề ORDER
covering-index-analysis=Phân tích chỉ mục phủ
table-join-analysis=Phân tích Joins
in-table=Bảng dữ liệu
where-use-column=Câu lệnh WHERE sử dụng cột
order-use-column=Câu lệnh ORDER sử dụng cột
covering-index-column=Câu lệnh WHERE và ORDER sử dụng cột
where-use-index=Câu lệnh WHERE sử dụng chỉ mục
order-use-index=Câu lệnh ORDER sử dụng chỉ mục
use-covering-index=Đã sử dụng chỉ mục phủ
create-index-for-performance=Khuyến nghị: Tạo chỉ mục cho các cột sau đây có thể cải thiện hiệu suất truy vấn
hint-index-for-performance=Gợi ý: Chỉ mục{hintIndexName} đã phủ các cột bao gồm: {hintIndexColumns}
create-covering-index-for-performance=Khuyến nghị: Tạo chỉ mục phủ cho các cột sau đây có thể cải thiện hiệu suất truy vấn
create-index-togeger=Tạo chỉ mục
create-index-individ=Tạo chỉ mục riêng lẻ
create-covering-index=Tạo chỉ mục phủ
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=Mã giả dưới đây hiển thị quá trình thực thi của trình tối ưu hóa truy vấn
cycle-count=Thống kê vòng lặp
optimize-cycle-count=Gợi ý: Thay đổi thứ tự các bảng JOIN khác nhau có thể tối ưu hóa và giảm số lần vòng lặp.
general-settings=Cài đặt chung
about=Giới thiệu
language-setting=Cài đặt ngôn ngữ giao diện
change-language-restart-text=Thay đổi ngôn ngữ, phải khởi động lại phần mềm này mới có hiệu lực.
close-and-restart=Đóng và khởi động lại
do-not-restart=Không khởi động lại
about-us=Về chúng tôi
about-us-description=CuteSqlite là phần mềm mã nguồn mở được phát triển bởi tác giả Xuehan Qin.
version-info=Phiên bản
version-info-description=CuteSqlite v0.2.2 beta (64 bit)
feedback=Phản hồi
feedback-description=Nếu bạn gặp vấn đề về phần mềm, hoặc có ý tưởng và gợi ý cho ứng dụng này, vui lòng điền vào biểu mẫu dưới đây để phản hồi cho chúng tôi.
content-text=Nội dung
license=Apache License Version 2.0
select-columns-analysis=Phân tích cột Select
select-use-column=Câu lệnh Select sử dụng các cột sau
select-use-column-count=Số lượng cột
select-use-column-advice=Khuyến nghị: Số cột được chọn trong câu lệnh SELECT vượt quá{maxColumns} cột, hãy giảm thiểu số cột để cải thiện hiệu suất truy vấn.
select-use-column-tips=Gợi ý: Giảm thiểu số cột có thể cải thiện hiệu suất truy vấn.
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=Phân tích lưu trữ:
analysis-sql=Phân tích SQL
open-perf-report=Mở báo cáo		Alt+O
drop-perf-report=Xóa báo cáo		Alt+Del
drop-perf-report-confirm-text=Bạn có chắc chắn muốn xóa báo cáo không?
store-analysis-text=Cho phép bạn phân tích dung lượng lưu trữ của cơ sở dữ liệu, bảng dữ liệu, chỉ mục bảng
table-store-analysis=Bảng - {tblName}
index-store-analysis=Chỉ mục - {idxName} - Thuộc bảng:{tblName}
db-disk-used-title=Báo cáo tỷ lệ sử dụng không gian đĩa, Đường dẫn DB:{dbPath}
page-size-text=Kích thước trang (Đơn vị: Byte)
page-size-tips=Kích thước trang (Đơn vị: Byte)
file-bytes-text=Kích thước tệp (Đơn vị: Byte)
file-bytes-tips=Kích thước tệp (Đơn vị: Byte)
file-pgcnt-text=Số trang trong toàn bộ tệp (Giá trị đo)
file-pgcnt-tips=Số trang trong toàn bộ tệp (Giá trị đo)
file-pgcnt2-text=Số trang trong toàn bộ tệp (Giá trị tính toán)
file-pgcnt2-tips=Số trang trong toàn bộ tệp (Giá trị tính toán)
inuse-pgcnt-text=Số trang lưu trữ dữ liệu (Đã dùng)
inuse-pgcnt-tips=Số trang lưu trữ dữ liệu (Đã dùng)
free-pgcnt2-text=Số trang không lưu trữ dữ liệu (Mỗi header)
free-pgcnt2-tips=Số trang không lưu trữ dữ liệu (Mỗi header)
free-pgcnt-text=Số trang không lưu trữ dữ liệu (Giá trị tính toán)
free-pgcnt-tips=Số trang không lưu trữ dữ liệu (Giá trị tính toán)
av-pgcnt-text=Số trang được xóa tự động
av-pgcnt-tips=Số trang được xóa tự động
ntable-text=Số bảng trong cơ sở dữ liệu
ntable-tips=Số bảng trong cơ sở dữ liệu
nindex-text=Số chỉ mục
nindex-tips=Số chỉ mục
nmanindex-text=Số chỉ mục định nghĩa
nmanindex-tips=Số chỉ mục định nghĩa
nautoindex-text=Số chỉ mục ẩn (Chỉ mục tự tăng)
nautoindex-tips=Số chỉ mục ẩn (Chỉ mục tự tăng)
user-payload-text=Số byte lưu trữ tải trọng hiệu quả của người dùng
user-payload-tips=Số byte lưu trữ tải trọng hiệu quả của người dùng
all-tbl-entrycnt-title=Lượng dữ liệu tất cả bảng (Số lượng)
all-tbl-idx-pagecnt-text=Số trang của tất cả bảng và chỉ mục của chúng
sperate-tbl-idx-pagecnt-title=Tính riêng số trang của tất cả bảng và chỉ mục
all-tbl-idx-report-title=Tất cả bảng và chỉ mục
total-pages-percent-text=Tỷ lệ phần trăm trên tổng số cơ sở dữ liệu
total-pages-percent-tips=Tỷ lệ phần trăm trên tổng số cơ sở dữ liệu
nentry-text=Lượng dữ liệu (Số lượng)
nentry-tips=Lượng dữ liệu (Số lượng)
storage-text=Số byte lưu trữ đã tiêu thụ
storage-tips=Số byte lưu trữ đã tiêu thụ
compressed-size-text=Số byte sử dụng sau khi nén
compressed-size-tips=Số byte sử dụng sau khi nén
payload-text=Số byte của tải trọng
payload-tips=Số byte của tải trọng
total-meta-text=Số byte của siêu dữ liệu
total-meta-tips=Số byte của siêu dữ liệu
depth-text=Độ sâu cây B
depth-tips=Độ sâu cây B
avg-payload-text=Tải trọng hiệu quả trung bình trên mỗi dữ liệu
avg-payload-tips=Tải trọng hiệu quả trung bình trên mỗi dữ liệu
avg-unused-text=Số byte chưa sử dụng trung bình trên mỗi dữ liệu
avg-unused-tips=Số byte chưa sử dụng trung bình trên mỗi dữ liệu
avg-meta-text=Siêu dữ liệu trung bình trên mỗi dữ liệu
avg-meta-tips=Siêu dữ liệu trung bình trên mỗi dữ liệu
avg-fanout-text=Số fanout trung bình
avg-fanout-tips=Số fanout trung bình
gap-cnt-text=Trang không liên tiếp
gap-cnt-tips=Trang không liên tiếp
mx-payload-text=Tải trọng hiệu quả tối đa trên mỗi dữ liệu
mx-payload-tips=Tải trọng hiệu quả tối đa trên mỗi dữ liệu
ovfl-cnt-text=Số lượng dữ liệu tràn đã sử dụng
ovfl-cnt-tips=Số lượng dữ liệu tràn đã sử dụng
int-pages-text=Số trang chỉ mục đã sử dụng
int-pages-tips=Số trang chỉ mục đã sử dụng
leaf-pages-text=Số trang lá đã sử dụng
leaf-pages-tips=Số trang lá đã sử dụng
ovfl-pages-text=Số trang tràn đã sử dụng
ovfl-pages-tips=Số trang tràn đã sử dụng
total-pages-text=Tổng số trang đã sử dụng
total-pages-tips=Tổng số trang đã sử dụng
int-unused-text=Số byte chưa sử dụng trên trang chỉ mục
int-unused-tips=Số byte chưa sử dụng trên trang chỉ mục
leaf-unused-text=Số byte chưa sử dụng trên trang lá
leaf-unused-tips=Số byte chưa sử dụng trên trang lá
ovfl-unused-text=Số byte chưa sử dụng trên trang tràn
ovfl-unused-tips=Số byte chưa sử dụng trên trang tràn
total-unused-text=Số byte chưa sử dụng trên tất cả các trang
total-unused-tips=Số byte chưa sử dụng trên tất cả các trang
all-table-report-title=Tất cả bảng (Loại trừ chỉ mục)
all-indices-report-title=Tất cả chỉ mục (Loại trừ bảng)
tbl-and-all-idx-report-title=Bảng {tblName} và tất cả chỉ mục của nó
tbl-only-report-title=Bảng {tblName} loại trừ bất kỳ chỉ mục nào
idx-only-report-title=Tất cả chỉ mục của bảng {tblName}
tbl-report-title=Bảng {tblName}
idx-report-title=Chỉ mục {idxName} của bảng {tblName}
props-tbl-only-report-title=Phân tích lưu trữ bảng {tblName}
props-idx-props-only-report-title=Tất cả chỉ mục của bảng {tblName}
db-pragma-params=Tham số PRAGMA
db-quick-config-params=Phương án cấu hình nhanh
select-pragma=PRAGMA
pragma-analysis-limit-tips=Truy vấn hoặc thay đổi giới hạn của cài đặt phân tích xấp xỉ (ANALYZE). Đây là số dòng xấp xỉ mà lệnh phân tích (ANALYZE) kiểm tra trong mỗi chỉ mục.
pragma-application-id-tips=Được sử dụng để truy vấn hoặc đặt số nguyên "Applicatioin ID" endian lớn 32 bit có dấu tại offset 68 vào đầu cơ sở dữ liệu.
pragma-auto-vacuum-tips=Truy vấn hoặc đặt trạng thái xóa tự động trong cơ sở dữ liệu.
pragma-automatic-index-tips=Truy vấn, đặt hoặc xóa chức năng chỉ mục tự động.
pragma-busy-timeout-tips=Truy vấn hoặc thay đổi cài đặt thời gian chờ bận (busy timeout).
pragma-cache-size-tips=Truy vấn hoặc thay đổi số trang đĩa cơ sở dữ liệu tối đa được SQLite khuyến nghị giữ trong bộ nhớ cho mỗi tệp cơ sở dữ liệu đã mở.
pragma-cache-spill-tips=Bật hoặc tắt chức năng tràn trang bộ nhớ đệm bẩn vào tệp cơ sở dữ liệu ở giữa giao dịch của trình phân trang.
pragma-case-sensitive-like-tips=Hành vi mặc định của toán tử LIKE là bỏ qua chữ hoa chữ thường của ký tự ASCII. Do đó, mặc định, 'a' LIKE 'A' là true.
pragma-cell-size-check-tips=Bật hoặc tắt các kiểm tra tính toàn vẹn khác khi đọc trang cây B cơ sở dữ liệu từ đĩa lần đầu tiên. Sau khi bật kiểm tra kích thước ô, hư hỏng cơ sở dữ liệu có thể được phát hiện sớm hơn và ít có khả năng "lan truyền (Spread)".
pragma-checkpoint-fullfsync-tips=Truy vấn hoặc thay đổi cờ fullfsync của hoạt động checkpoint. Nếu cờ này được đặt, phương pháp đồng bộ hóa F_FULLFSYNC sẽ được sử dụng trong quá trình thực hiện hoạt động checkpoint trên các hệ thống hỗ trợ F_FULLFSYNC. Giá trị mặc định của cờ CHECKPOINT_FULLFSYNC là OFF. Chỉ Mac OS-X hỗ trợ F_FULLFSYNC.
pragma-collation-list-tips=Trả về danh sách các trình tự sắp xếp được xác định cho kết nối cơ sở dữ liệu hiện tại.
pragma-compile-options-tips=Trả về tên của các tùy chọn thời gian biên dịch được sử dụng khi xây dựng SQLite, mỗi tùy chọn một dòng.
pragma-count-changes-tips=Truy vấn hoặc thay đổi cờ đếm thay đổi. Thông thường, khi cờ count-changes không được đặt, các câu lệnh INSERT, UPDATE và DELETE không trả về dữ liệu.
pragma-data-store-directory-tips=Truy vấn hoặc thay đổi giá trị của biến toàn cục sqlite3_data_directory, giao diện backend hệ điều hành Windows sử dụng biến này để xác định vị trí lưu trữ tệp cơ sở dữ liệu được chỉ định bằng tên đường dẫn tương đối.
pragma-data-version-tips=Cho biết tệp cơ sở dữ liệu đã được sửa đổi. Các chương trình tương tác lưu trữ nội dung cơ sở dữ liệu trong bộ nhớ hoặc hiển thị nội dung cơ sở dữ liệu trên màn hình có thể sử dụng lệnh PRADMA data_version để xác định xem chúng có cần làm mới và tải lại bộ nhớ hoặc cập nhật hiển thị màn hình không.
pragma-default-cache-size-tips=Truy vấn hoặc đặt số trang bộ nhớ đệm đĩa tối đa được khuyến nghị sẽ được phân bổ cho mỗi tệp cơ sở dữ liệu đã mở.
pragma-defer-foreign-keys-tips=Cho biết tất cả các ràng buộc khóa ngoại bị trì hoãn cho đến khi giao dịch ngoài cùng được commit.
pragma-empty-result-callbacks-tips=Truy vấn hoặc thay đổi cờ gọi lại kết quả rỗng.
pragma-encoding-tips=Mã hóa văn bản được sử dụng bởi cơ sở dữ liệu chính, một trong 'UTF-8', 'UTF-16le'(Mã hóa UTF-16 endian nhỏ) hoặc 'UTF-16be'(Mã hóa UTF-16 endian lớn).
pragma-foreign-key-check-tips=Kiểm tra xem cơ sở dữ liệu hoặc bảng có vi phạm ràng buộc khóa ngoại không
pragma-foreign-keys-tips=Truy vấn, đặt hoặc xóa việc thực thi ràng buộc khóa ngoại.
pragma-freelist-count-tips=Trả về số trang chưa sử dụng trong tệp cơ sở dữ liệu.
pragma-full-column-names-tips=Truy vấn hoặc thay đổi cờ full_column_names.
pragma-fullfsync-tips=Truy vấn hoặc thay đổi cờ fullfsync. Cờ này xác định xem phương pháp đó có được sử dụng trên các hệ thống hỗ trợ phương pháp đồng bộ hóa F_FULLFSYNC không. Giá trị mặc định của cờ Fullfsync là OFF. Chỉ Mac OS X hỗ trợ F_FULLFSYNC.
pragma-hard-heap-limit-tips=Áp đặt giới hạn về lượng bộ nhớ heap cho tất cả các kết nối cơ sở dữ liệu trong một quy trình duy nhất.
pragma-ignore-check-constraints-tips=Bật hoặc tắt việc thực thi ràng buộc kiểm tra. Cài đặt mặc định là OFF, nghĩa là ràng buộc kiểm tra được thực thi theo mặc định.
pragma-incremental-vacuum-tips=Khiến tối đa N trang bị xóa khỏi danh sách miễn phí.
pragma-integrity-check-tips=Thực hiện kiểm tra định dạng và tính nhất quán cấp thấp trên cơ sở dữ liệu.
pragma-journal-mode-tips=Truy vấn hoặc đặt chế độ nhật ký của cơ sở dữ liệu được liên kết với kết nối cơ sở dữ liệu hiện tại.
pragma-journal-size-limit-tips=Giới hạn kích thước của nhật ký rollback và tệp WAL còn lại trong hệ thống tệp sau giao dịch hoặc checkpoint.
pragma-legacy-alter-table-tips=Đặt hoặc truy vấn giá trị của cờ legacy_alter_table.
pragma-locking-mode-tips=Đặt hoặc truy vấn chế độ khóa kết nối cơ sở dữ liệu. Chế độ khóa là chế độ bình thường (NORMAL) hoặc chế độ độc quyền (EXCLUSIVE).
pragma-max-page-count-tips=Truy vấn hoặc đặt số trang tối đa trong tệp cơ sở dữ liệu.
pragma-mmap-size-tips=Truy vấn hoặc thay đổi số byte tối đa được dành cho I/O bộ nhớ ánh xạ (memory-mapped I/O) trên một cơ sở dữ liệu duy nhất.
pragma-module-list-tips=Trả về danh sách các mô-đun bảng ảo được đăng ký với kết nối cơ sở dữ liệu.
pragma-optimize-tips=Cố gắng tối ưu hóa cơ sở dữ liệu.
pragma-page-count-tips=Trả về tổng số trang trong tệp cơ sở dữ liệu.
pragma-page-size-tips=Truy vấn hoặc đặt kích thước trang của cơ sở dữ liệu. Kích thước trang phải là lũy thừa của 2 nằm giữa 512% và 65536.
pragma-parser-trace-tips=Bật theo dõi trình phân tích cú pháp SQL được SQLite sử dụng nội bộ. Có hiệu lực khi biên dịch với SQLITE_DEBUG.
pragma-query-only-tips=Ngăn chặn thay đổi dữ liệu trên tệp cơ sở dữ liệu. Khi bật mục này, bất kỳ nỗ lực CREATE, REPORT, DROP, REPORT hoặc UPDATE nào cũng sẽ dẫn đến lỗi SQLITE_READONLY.
pragma-quick-check-tips=Thực hiện cài đặt định dạng và kiểm tra tính nhất quán cấp thấp trên cơ sở dữ liệu, bỏ qua kiểm tra tính nhất quán UNIQUE và chỉ mục.
pragma-read-uncommitted-tips=Truy vấn, đặt hoặc xóa cách ly READ UNCOMMITTED.
pragma-recursive-triggers-tips=Truy vấn, đặt hoặc xóa chức năng đệ quy của trigger.
pragma-reverse-unordered-selects-tips=Khi được bật, PRAGMA này khiến nhiều câu lệnh SELECT không có mệnh đề ORDER BY phát hành kết quả theo thứ tự ngược lại với bình thường.
pragma-schema-version-tips=Lấy hoặc đặt giá trị số nguyên chema-versio tại offset 40 trong đầu cơ sở dữ liệu.
pragma-secure-delete-tips=Truy vấn hoặc thay đổi cài đặt xóa an toàn (secure-delete).
pragma-short-column-names-tips=Truy vấn hoặc thay đổi cờ tên cột ngắn.
pragma-soft-heap-limit-tips=Giới hạn lượng bộ nhớ heap bị chiếm dụng cho tất cả các kết nối cơ sở dữ liệu trong một quy trình duy nhất.
pragma-stats-tips=Trả về thông tin phụ trợ về bảng và chỉ mục.
pragma-synchronous-tips=Truy vấn hoặc thay đổi cài đặt cờ "đồng bộ (synchronous)".
pragma-temp-store-tips=Truy vấn hoặc thay đổi giá trị của biến toàn cục sqlite3_temp_directory, nhiều backend giao diện hệ điều hành sử dụng biến này để xác định nơi lưu trữ các bảng và chỉ mục tạm thời.
pragma-threads-tips=Số luồng phụ trợ được bắt đầu bởi câu lệnh đã chuẩn bị (prepared statement) để hỗ trợ truy vấn.
pragma-trusted-schema-tips=Cho phép chạy các hàm SQL và bảng ảo chưa được kiểm tra bảo mật trong schema không. Xác định xem có cho phép view, trigger hoặc biểu thức schema (như ràng buộc CHECK, mệnh đề DEFAULT, cột được tạo, chỉ mục biểu thức và/hoặc chỉ mục một phần) chạy các hàm SQL và bảng ảo chưa được kiểm tra bảo mật không.
pragma-user-version-tips=Lấy hoặc đặt giá trị số nguyên user-version tại offset 60 trong đầu cơ sở dữ liệu
pragma-vdbe-addoptrace-tips=Mã hoạt động VDBE đầy đủ được hiển thị khi được tạo trong quá trình tạo mã.的前提 là SQLite được biên dịch với tùy chọn SQLITE_DEBUG và vdbe_debug được bật.
pragma-vdbe-debug-tips=Bật gỡ lỗi VDBE,前提 là SQLite được biên dịch với tùy chọn SQLITE_DEBUG
pragma-vdbe-listing-tips=Hiển thị danh sách mã hoạt động máy ảo đầy đủ trên đầu ra chuẩn.前提 là SQLite được biên dịch với tùy chọn SQLITE_DEBUG và vdbe_debug được bật.
pragma-vdbe-trace-tips=In mã hoạt động máy ảo trên đầu ra chuẩn khi tính toán.前提 là SQLite được biên dịch với tùy chọn SQLITE_DEBUG và vdbe_debug được bật.
pragma-wal-autocheckpoint-tips=Truy vấn hoặc đặt khoảng thời gian nhật ký ghi trước (write-ahead log)/auto-checkpoint.
pragma-wal-checkpoint-tips=Khiến nội dung trong nhật ký ghi trước (write-ahead log) của cơ sở dữ liệu X trên kết nối cơ sở dữ liệu D được truyền vào tệp cơ sở dữ liệu và đặt lại nhật ký ghi trước (write-ahead log).
pragma-writable-schema-tips=Có thể thay đổi bảng sqlite_schema bằng các câu lệnh UPDATE, INSERT và DELETE thông thường. Cảnh báo: Lạm dụng chỉ thị biên dịch này rất dễ dẫn đến hư hỏng tệp cơ sở dữ liệu.
pragma-save-confirm=Câu lệnh PRAGMA sẽ ảnh hưởng đến hoạt động của cơ sở dữ liệu, bạn có chắc chắn muốn thực thi các câu lệnh dưới đây không?
confirm-exec-text=Xác nhận &Thực thi